[
    {
        "id": "1",
        "nama": "Stasiun Blimbing",
        "deskripsi": "Stasiun Blimbing (BMG) adalah salah satu dari tiga stasiun kereta api yang terletak di Kota Malang, tepatnya berada di Kelurahan Purwodadi, Blimbing, Malang. Stasiun yang terletak pada ketinggian +460 m ini termasuk dalam Daerah Operasi VIII Surabaya dan menjadi stasiun kereta api yang lokasi paling utara di Kota Malang. Pada masa penjajahan Belanda, stasiun ini adalah pusat Malang Stoomtram Maatschappij.\nStasiun ini terletak 200 meter dari jalan utama Malang-Tumpang. Dari stasiun ini ke arah timur, terdapat bekas rel yang akan berakhir di Tumpang. Jalur ini juga memiliki percabangan menuju Bandara Abdul Rachman Saleh. Stasiun ini dahulu juga mempunyai percabangan jalur trem ke Stasiun Singosari dan Stasiun Malang Jagalan, namun kini jalur tersebut sudah tiada.\nStasiun ini memiliki tiga jalur dengan jalur 2 sebagai sepur lurus.",
        "foto": "/Assets/gambar/blimbing.jpg"
    },
    {
        "id": "2",
        "nama": "Stasiun Lawang",
        "deskripsi": "Stasiun Lawang (LW) merupakan stasiun kereta api kelas I yang terletak di Mulyoarjo, Lawang, Malang serta merupakan stasiun yang letaknya paling utara dan timur sekaligus terbesar di Kabupaten Malang. Stasiun ini merupakan stasiun yang terletak pada ketinggian tertinggi di Daerah Operasi VIII Surabaya, yakni +491 m. Akibatnya, jalur antara Bangil-Lawang — yang berjarak 31 km — tergolong terjal, di mana Stasiun Bangil — yang notabene merupakan stasiun percabangan antara jalur Surabaya, Malang, dan Probolinggo — terletak pada ketinggian +9 m, sehingga kemiringan jalur adalah 15,3 permil. Sementara itu, walaupun sempat menanjak lagi setelah lepas stasiun ini, jalur ke arah selatan relatif menurun.\nStasiun Lawang terletak tepat di pinggir jalan utama Malang-Surabaya dan di seberang pasar. Ke arah utara, jalur kereta api akan melintas di bawah jembatan layang.\nStasiun Lawang didirikan pada tahun 1887, menjadikan stasiun ini bangunan tertua di Lawang. Stasiun ini memiliki tiga jalur dengan jalur 1 sebagai sepur lurus.",
        "foto": "/Assets/gambar/lawang.jpg"
    },
    {
        "id": "3",
        "nama": "Stasiun Kepanjen",
        "deskripsi": "Stasiun Kepanjen (KPN) adalah stasiun kereta api kelas I yang terletak di Kepanjen, Kepanjen, Malang. Stasiun yang terletak pada ketinggian +335 m ini termasuk dalam Daerah Operasi VIII Surabaya. Stasiun ini memiliki tiga jalur dengan jalur 1 sebagai sepur badug (rel buntu), jalur 2 (spoor 1) sebagai sepur lurus, dan jalur 3 (spoor 2) untuk persilangan kereta api atau dalam keadaan darurat.\nSebenarnya stasiun ini memiliki lebih dari 3 jalur. Jalur 1 dulunya merupakan jalur aktif, namun pada perkembangannya dibangunlah peron stasiun dan musala di utara stasiun serta pemindahan ruang PPKA yang sebelumnya terletak di ruang tunggu VVIP/reservasi tiket. Jalur 2 dan 3 tetap tidak berubah. Jalur 4 berada di sebelah timur jalur 3 yang saat ini menjadi ruko stasiun dan kantor jasa ekspedisi pengiriman barang yang dikelola oleh PT Herona Express dan PT KA Logistik. Jalur 4 dulunya juga merupakan jembatan timbang dan depot kereta api. Namun sejak tahun 1990-an, jalur 4 dihilangkan dan depotnya dipindahkan ke Stasiun Malang.\nDahulu ada dua stasiun yang bernama Kepanjen pada zaman kolonial Belanda, yaitu Stasiun Kepanjen milik Staatsspoorwegen (SS), dan yang satunya lagi milik Malang Stoomtram Maatschappij (MSM) yang mengoperasikan trem uap dan berlokasi di belakang Masjid Agung Baiturrahman Kepanjen (saat ini menjadi SMP Islam). Trem tersebut dulunya merupakan transportasi antardesa/kecamatan, baik angkutan orang maupun barang/rempah-rempah hasil rampasan Belanda. Jalur rel Stasiun Kepanjen Trem sangat panjang koridornya. Stasiun yang terdaftar mulai dari Kepanjen-Halte Sumedang-Halte Panggungrejo-Halte Mangunrejo-Halte Sengguruh-Halte Kemiri. Setelah dari Halte Kemiri, jalur trem tersebut kemudian menyeberangi sungai melalui Jembatan Afiat dan menyambung hingga Halte Brongkal-Halte Banjarejo-stasiun Gondanglegi. Di stasiun Gondanglegi, kemudian jalur tersebut mengalami percabangan terpisah menjadi tiga jalur. Satu jalur dari arah Kepanjen, satu jalur menuju arah Malang Kota Lama dan satu jalur lagi menuju arah Stasiun Dampit.",
        "foto": "/Assets/gambar/kepanjen.jpg"
    },
    {
        "id": "4",
        "nama": "Stasiun Kotabaru",
        "deskripsi": "Stasiun Malang (ML) merupakan stasiun kereta api kelas besar yang terletak di Klojen, Kota Malang. Stasiun yang terletak pada ketinggian +444 meter ini merupakan stasiun kereta api terbesar di Kota Malang. Stasiun yang termasuk dalam Daerah Operasi VIII Surabaya ini memiliki dua belas jalur aktif dengan jalur 3 sebagai sepur lurus. \n Stasiun ini dibangun pada tahun 1941 berdasarkan karya J. van der Eb. Stasiun ini terkadang disebut sebagai Stasiun Malang Kotabaru untuk membedakannya dengan Stasiun Malang Kotalama yang usianya lebih tua. \n Pada awalnya, bangunan stasiun ini berada di sisi timur bangunan yang sekarang. Sesuai rancangan awal, penumpang yang baru turun dari kereta api akan disuguhi pemandangan Gunung Panderman di sebelah barat. Oleh karena bangunan stasiun ini dianggap tidak mampu lagi menampung jumlah penumpang yang terus meningkat, maka dibuatlah bangunan baru yang lebih besar di sisi barat. Bangunan baru ini terus dipakai hingga sekarang dan bangunan lama yang kini bersebelahan dengan Dipo Kereta dan Sub Dipo Lokomotif Malang difungsikan sebagai kantor dan gudang untuk menyimpan alat-alat perawatan jalur kereta api. \nSaat ini, lokasi stasiun ini sangat strategis karena terletak tidak jauh dari Alun-Alun Bundar, kompleks SMA Tugu (SMA Negeri 1, SMA Negeri 3, dan SMA Negeri 4 Malang), Gedung DPRD Kota Malang, Balai Kota Malang, Pasar Klojen, Hotel Tugu Inn, dan Markas Kodam V Brawijaya.",
        "foto": "/Assets/gambar/kotabaru.jpg"
    },
    {
        "id": "5",
        "nama": "Stasiun Kotalama",
        "deskripsi": "Stasiun Malang Kotalama (MLK) adalah stasiun kereta api kelas I yang terletak di Ciptomulyo, Sukun, Kota Malang. Stasiun yang berada pada ketinggian +429 meter ini termasuk dalam Daerah Operasi VIII Surabaya. Stasiun ini adalah stasiun kereta api paling selatan di Kota Malang sekaligus yang tertua, dibangun pada tahun 1879. Penambahan nama Kotalama dimaksudkan untuk membedakan dengan Stasiun Malang yang dibangun belakangan dan penamaan \"Kotalama\" juga karena usia bangunan.\nStasiun ini memiliki enam jalur dengan jalur 1 sebagai sepur lurus dan dari jalur 4 terdapat percabangan rel yang menuju ke Depo Pertamina. Dari stasiun ini juga, dahulu terdapat percabangan jalur menuju Dampit yang kini sudah dinonaktifkan. Di jalur ini juga terdapat bekas Stasiun Jagalan yang kini sudah menjadi salah satu rumah warga.\nKe arah selatan stasiun ini, sebelum Stasiun Pakisaji, terdapat Stasiun Kebonagung, namun kini sudah dinonaktifkan karena letaknya yang kurang strategis dan okupansi penumpang yang minim.",
        "foto": "/Assets/gambar/kotalama.jpg"
    },
    {
        "id": "6",
        "nama": "Stasiun Sumberpucung",
        "deskripsi": "Stasiun Sumberpucung (SBP) adalah stasiun kereta api kelas III/kecil yang terletak di Sumberpucung, Sumberpucung, Malang. Stasiun yang termasuk dalam Daerah Operasi VIII Surabaya ini terletak pada ketinggian +296 meter serta merupakan stasiun KA aktif yang lokasinya paling barat dan selatan di Kabupaten Malang. Stasiun ini termasuk jenis sisi dan memiliki dua jalur dengan jalur 1 sebagai sepur lurus.\nKira-kira lima kilometer sebelah barat stasiun ini dapat dijumpai Bendungan Ir. Sutami. Di sebelah bendungan tersebut, terdapat dua terowongan kereta api, yaitu Eka Bhakti Karya dan Dwi Bhakti Karya, masing-masing sepanjang 850 dan 400 meter.",
        "foto": "/Assets/gambar/sumberpucung.jpg"
    }
]